# ViewScheduleExportOptions Constructor (ViewScheduleExportOptions)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewScheduleExportOptions Constructor (ViewScheduleExportOptions)
ViewScheduleExportOptions Class See Also
---
Constructs a new copy of the input ViewScheduleExportOptions object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ViewScheduleExportOptions(
	ViewScheduleExportOptions other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As ViewScheduleExportOptions _
)
```

Visual C++
---
```text
public:
ViewScheduleExportOptions(
	ViewScheduleExportOptions^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..ViewScheduleExportOptions
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ViewScheduleExportOptions Class
ViewScheduleExportOptions Overload
Autodesk.Revit.DB Namespace